app/views/appetizers/_result.html.erb


<% current_user.carts.each do |cart| %>
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 1