app/views/appetizers/show.html.erb

           <ul class = 'selected_items' >
           <% @appetizer.appetizer_line_items.each do |appetizer_line_item| %>
---
SELECT `appetizer_line_items`.* FROM `appetizer_line_items` WHERE `appetizer_line_items`.`appetizer_id` = 1