app/controllers/appetizers_controller.rb

SELECT `appetizers`.* FROM `appetizers`
---
  def index
    @appetizers = Appetizer.all

SELECT `appetizers`.* FROM `appetizers` WHERE `appetizers`.`id` = 4 LIMIT 1
---
  def show
    @appetizer = Appetizer.find(params[:id]) rescue nil

SELECT `appetizers`.* FROM `appetizers` WHERE `appetizers`.`id` = 4 LIMIT 1
---
  def edit
    @appetizer = Appetizer.find(params[:id])

SELECT `appetizers`.* FROM `appetizers` WHERE `appetizers`.`id` = 1 LIMIT 1
UPDATE `appetizers` SET `description` = 'fdsfdsfdsf', `updated_at` = '2015-04-29 03:15:59' WHERE `appetizers`.`id` = 1
---
  def update
    @appetizer = Appetizer.find(params[:id])

    respond_to do |format|
      if @appetizer.update_attributes(params[:appetizer])

SELECT `appetizer_line_items`.* FROM `appetizer_line_items` WHERE `appetizer_line_items`.`appetizer_id` = 1
SELECT `appetizers`.* FROM `appetizers` WHERE `appetizers`.`id` = 1 LIMIT 1
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 3 LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 1 AND `carts`.`user_id` = 1 AND `carts`.`appetizer_line_item_id` = 1 LIMIT 1
DELETE FROM `carts` WHERE `carts`.`id` = 4
INSERT INTO `carts` (`appetizer_line_item_id`, `created_at`, `updated_at`, `user_id`) VALUES (3, '2015-04-29 17:18:15', '2015-04-29 17:18:15', 1)
---
  def selected_items
    items = params[:items].split(',')

    appetizer_ids = Appetizer.find(params[:appetizer_id]).appetizer_line_items.collect(&:id)

    unselected_items = []
    unselected_items.clear

     appetizer_ids.each do |item|
        unless items.include? item.to_s
           unselected_items << item
        end
     end


    unselected_items.each do |unselected_item|
      cart = current_user.carts.where(:user_id => current_user.id, :appetizer_line_item_id => unselected_item)
      if cart.present?
         cart.first.destroy
      end
    end


    items.each do |item|
      item_id = item.split(':')[0]
      cart = current_user.carts.where(:user_id => current_user.id, :appetizer_line_item_id => item_id)


      unless cart.present?
        @cart = current_user.carts.build(:user_id => current_user.id, :appetizer_line_item_id => item_id)
        @cart.save!