app/controllers/site_controller.rb

SELECT `appetizers`.* FROM `appetizers`
---
  def index
    #http://stopandshop.com/recipes-and-meals/recipes/beer-steamed-clams/
    @appetizer = Appetizer.all