app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `failed_login_count`, `last_login_at`, `last_login_ip`, `last_request_at`, `login`, `login_count`, `name`, `password_salt`, `perishable_token`, `persistence_token`, `single_access_token`, `updated_at`) VALUES ('2015-04-27 03:41:04', '400$8$b$2c08e7f46b32d2c6$c22802d584aa912a233f799b6d779a8fb8b716deaf12ebed604b25f8e5729e02', '2015-04-27 03:41:04', '127.0.0.1', 'vijay@gmail.com', 0, NULL, NULL, '2015-04-27 03:41:04', 'vijay', 1, '', 'RJeRxbKQRn3x8qYWacHM', 'J8m8Sg9xstQWI0jpBDu', 'ea8ff8cc55a7a811e0f4de257f196df2613efe23a8b82c7a2f75accfba071a440e248c31ede016d32868912826b2438d1e890dcb73fcbcb5f291a88ad330da13', 'KCQixlr9V1wL91Z6cvxW', '2015-04-27 03:41:04')
---
  def create
    @user = User.new(params[:user])
    if @user.save